#include "Data_structures.h"
//#include "My_exeptions.h"

/*
Двозв'язний список
додавання вузла в початок списку,
додавання вузла,
пошук вузла в списку,
видалення вузла,
виведення вузлів на екран з початку та з кінця.
*/

/*
Купа(черга з пріорітетами)
вставлення елементу, сортування елементів, побудова купи з
невпорядкованого масиву, видалення елементу, сортування елементів
із використанням купи, виведення елементів на екран.
*/

/*
Пірамідальне сортування
*/

/*
Варіант No 3
Інформація про студентів групи включає наступну інформацію:
– прізвище, ім’я, по батькові;
– адреса;
– середній бал;
– стать;
– дата народження.
Вивести перелік місяців, відсортований за кількістю студентів
групи, які народилися в даний місяць. У випадку однакової кількості
за абеткою.
*/

//Масиви данних зберігаються у файлах