#include "Data_structures.h"
#include "Algoritms.h"
using namespace algoritms;
using namespace data_struct;
using std::cout;
using std::endl;
using std::cin;
/*
Двозв'язний список
додавання вузла в початок списку,
додавання вузла,
пошук вузла в списку,
видалення вузла,
виведення вузлів на екран з початку та з кінця.
*/

/*
Купа(черга з пріорітетами)
вставлення елементу,
сортування елементів,
побудова купи з невпорядкованого масиву,
видалення елементу, 
сортування елементів із використанням купи,
виведення елементів на екран.
*/
/*
Пірамідальне сортування
*/
/*
Варіант No 3
Інформація про студентів групи включає наступну інформацію:
– прізвище, ім’я, по батькові;
– адреса;
– середній бал;
– стать;
– дата народження.
Вивести перелік місяців, відсортований за кількістю студентів
групи, які народилися в даний місяць. У випадку однакової кількості
за абеткою.
*/
//Масиви данних зберігаються у файлах

int main() {
	My_exception_codes_file(); //якщо користувач видалить в каталозі файл txt з кодами, помилок, він знову створиться
	//ТЕСТ!!!
	main_test_dl_list(cout); cout << endl;
	main_test_priory_queue_heap(cout); cout << endl;
	main_test_piramidal_sort(cout); cout << endl;
	cout << "СПИСОК,КУПА З ПРІОРІТЕТАМИ ТА ПІРАМІДАЛЬНЕ СОРТУВАННЯ УСПІШНО ПРОЙШЛИ ТЕСТ!" << endl << endl << endl;
	
	char tmp;
	do {
		cout << "Випадково заповнювати інформацію про студентів? [n/y]: ";
		cin >> tmp;
		if (tmp == 'n') {
			cout << "Погано!";
			break;
		}
		else if (tmp == 'y') {
			cout << "Добре!";
			break;
		}
	} while (true);

	return 0;
}

